/*
                              ___/\___
                         - Space Invaders -
						      --------

Main class - Game
	Отвечает за основной игровой цикл
	Должен управлять сложностью игры и в целом быть оболочкой для игровой логики программы

 Игровое поле - Scene 
	Должна знать где располагаются игровые объекты и что они такое (последнее опционально)

 Класс игрового объекта - базовый класс для всего что может быть расположено на игровой сцене

 Класс координат - запоминает позицию


 Игроки, спрайты, снаряды и прочее будет наследниками игрового объекта

*/


#include <iostream>

int main()
{

	return 0;
}